package com.example.newsclient.Model.bean;

import com.example.newsclient.Model.bean.NewsBean;

import java.util.List;

/**
 * Created by Administrator on 2016-04-12.
 */
public class NewsListBean {

    /**
     * errNum : 0
     * errMsg : success
     * retData : {"return_count":20,"has_more":1,"offset":20,"data":[{"title":"黄大炜炮轰《康熙》撒谎 发1755字长文怒揭内幕","abstract":"黄大炜在脸书力挺陈小春小S和蔡康永主持的综艺《康熙来了》，在两岸都有极高的收视率和死忠粉丝，岂料2人却在16日无预警宣布\u201c共进退\u201d辞退主持棒，在娱乐圈掀起一阵哗然。原本传艺人陈小春将参加最终集录制，岂料却爆出和制作单位认知不同被退通告，黄大炜更因看不下去，跳出来为好友叫屈，4日在","url":"http://m.gmw.cn/toutiao/2015-12/05/content_110078287.htm","datetime":"2015-12-05 08:58","img_url":"http://p3.pstatp.com/list/10096/2499301616"},{"title":"郭富城再晒用餐恩爱照 第二波\u201c慢一点\u201d体引集体吐槽","abstract":"郭富城破天荒高调晒爱后，他公开恋情时的\u201c慢一点\u201d体也成为网络热潮。第一浪的\u201c开车要慢一点\u201d，引起网友疯狂模仿，而秀恩爱第二波的\u201c慢一点\u201d体，却引发网友集体吐槽，才短短两个半小时，就有超过4万条负评。","url":"http://fun.youth.cn/2015/1205/3056543.shtml","datetime":"2015-12-05 10:54"},{"title":"范冰冰认李晨为最后男友 男方承诺必大婚：当然娶她！","abstract":"小S获准袭胸李晨，连探班的徐妈妈都进场\u201c验货\u201d。范冰冰与小S互相称赞对方的肤质腾讯娱乐讯 据台湾媒体《东森新闻云》12月4日报道，《康熙来了》(视频)日前最后一次进棚录影，请到\u201c范爷\u201d范冰冰和男友李晨跨海相挺担任嘉宾，完成小S想看到范冰冰本人的心愿。","url":"http://ent.cnr.cn/yltj/20151205/t20151205_520696848.shtml","datetime":"2015-12-05 09:16","img_url":"http://p2.pstatp.com/list/10094/3255543821"},{"title":"盘点那些靠激情床戏大火的电视剧","abstract":"","url":"http://m.gmw.cn/toutiao/2015-12/04/content_17971865.htm","datetime":"2015-12-04 18:18","img_url":"http://p3.pstatp.com/list/10074/2687153666"},{"title":"娱乐圈有多少女星为自己老公保留了初夜？","abstract":"自古以来对于女性都是有着极其苛刻的要求和束缚等等，而对于传统的社会来说女人的贞洁尤为重要。随着社会的开放度越来越高，现如今很多人对于\u201c初夜\u201d这个词已经不像我们父辈们那么重视。而对于娱乐圈的女星来说，因为环境的复杂性，为老公保留初夜更是难上加难的事情，下面我们就来盘点一下到底娱乐圈","url":"http://m.cnr.cn/ent/20151204/t20151204_520689329_tt.html","datetime":"2015-12-04 12:44","img_url":"http://p3.pstatp.com/list/10059/6700453056"},{"title":"黄贯中晒凶猛巨型藏獒照 高出朱茵两个头","abstract":"朱茵在巨型藏獒\u201c酋长\u201d身边，俨如小女孩。黄贯中(Paul)日前在微博分享巨无霸\u201c沙展\u201d剥牙的血淋淋经历，他养的藏獒引起不少网民注意。昨天黄贯中又晒宝贝，在微博上载太太朱茵跟另一只藏獒\u201c酋长\u201d的合照。娇小的朱茵站在比她高两个头的\u201c酋长\u201d身边像小女孩。","url":"http://www.zj.xinhuanet.com/yltd/2015-12/05/c_1117365501.htm","datetime":"2015-12-05 11:33","img_url":"http://p3.pstatp.com/list/10095/3331634426"},{"title":"亚洲最帅男人吴尊唯美结婚照曝光 老婆林丽莹美艳动人","abstract":"","url":"http://toutiao.com/preview_article/?pgc_id=6224581809124934145","datetime":"2015-12-05 07:56","img_url":"http://p2.pstatp.com/list/10091/2574489109"},{"title":"时隔8年，《丑女无敌》剧组的不红诅咒还能不能应验？","abstract":"2008年爆红了一部《丑女无敌》，而剧中的主演们却并没有靠这部大剧火起来，今天，阿姨就来扒一下这部\u201c不红诅咒\u201d的电视剧。林无敌\u2014李欣汝今年已经31岁的李欣汝，从08年的《丑女无敌》到现在，她的颜值经历了大幅度的波动，简直就是一个谜。《丑女无敌》里的她是这样的《宝莲灯前传》里的她是","url":"http://toutiao.com/group/6224439253100052737/","datetime":"2015-12-04 23:06","img_url":"http://p2.pstatp.com/custom/10081/4404776115/0_0_400_279_0.43/"},{"title":"娱乐圈里的\u201c神话\u201d竟然培养出这样的儿子","abstract":"他们是众所周知的好搭档，好伴侣。一首\u201c知心爱人\u201d红遍大江南北，其实付笛声还有很多好的作品，比如《众人划桨开大船》《掌声响起来》《你是幸福的， 我是快乐的》等等等，，，但大家可能只记得一首那就是《知心爱人》下面来说说他们的事。1988年与任静相识，1989年2月5日与任静结婚，儿子","url":"http://toutiao.com/preview_article/?pgc_id=6223500350016471553","datetime":"2015-12-04 15:28","img_url":"http://p2.pstatp.com/custom/10011/7959957393/0_136_517_497_0.3327/"},{"title":"她24岁演《倩女幽魂》走红 嫁3亿富翁 化疗致毁容","abstract":"今天是12月2日，大家先记住这个日子早上，香港媒体爆出名媛薛芷伦上街和大妈们吵架，薛芷伦还用手推了大妈一把。这都不是重点，重点是她的脸\u2026\u2026看一边吃蛋挞的大妈们的表情也是把\u201c惊呆\u201d这种心情诠释得很到位更神奇的是，上一次港媒出来报道薛芷伦的新闻正是一年前的今天，14年12月2日\u2026\u2026当","url":"http://www.cnr.cn/ent/list/20151204/t20151204_520690222.shtml","datetime":"2015-12-04 14:08","img_url":"http://p3.pstatp.com/list/10065/3203391737"},{"title":"李宇春修完这个眉毛，人漂亮百倍！","abstract":"我们先来看看眉毛审美大变迁！相比之前的细眉年代，本公举表示活在这个年代真的非常开心啊！！（咳咳，雾面粗眉显脸小！大脸妹你们懂得）The 1920\u2032s\u2014\u2014线型平眉The 1930\u2032s\u2014\u2014拱形细眉The 1940\u2032s\u2014\u2014自然挑眉如今\u2014\u2014请为你生活在如此时髦的年代手动点赞吧！那么说到又","url":"http://toutiao.com/group/6224412069878399234/","datetime":"2015-12-04 21:18","img_url":"http://p3.pstatp.com/list/10024/6199116317"},{"title":"日女星曝游香港被性骚扰：按摩师拉开纸内裤","abstract":"菊地亚美偶像团体\u201c美少女甜甜圈\u201d成员菊地亚美，现积极活跃于各大综艺节目，菊地亚美上综艺节目一向大胆敢言，时常语出惊人。日前菊地亚美出演综艺节目时，针对之前曾经前往香港一事，又爆出惊人话语。菊地亚美说到\u201c之前和友人一同前往香港的按摩店，原本想说体验一下当地有名的按摩，因为是规定，所","url":"http://www.quanminxingtan.com/news/566230d2ac9bdf48fa01018b/share","datetime":"2015-12-05 08:41"},{"title":"郭富城公布恋情深圳交警不服？真相原来是这样的！","abstract":"前天晚上，微博里除了工作就是工作的郭富城居然晒了张牵手照片，并写到\u201c这样开车要慢一点\u201d，哎呦我去，这不是明摆着昭告天下\u201c我也翻了网红的牌了吗\u201d！！来源丨微博、网络文丨请叫我董事长小伙伴们迅速去围观了天王嫂，撸完她皂片的宅男们都自动流出了鼻血，天王嫂就俩字：美！俩字：美得一比！但是","url":"http://toutiao.com/group/6224438705295376642/","datetime":"2015-12-04 23:04","img_url":"http://p3.pstatp.com/list/10079/5508923205"},{"title":"网曝海陆怀孕 于小彤或退出真人秀陪女友待产","abstract":"今日，有微博爆料：\u201c紫薇\u201d海陆已怀孕，\u201c贾宝玉\u201d于小彤喜当爹。这对不被外界看好的姐弟恋似乎将修成正果。爆料中称，海陆在录制真人秀《咱们穿越吧》时，小腹凸起明显，脚上一反常态没有穿女明星的恨天高，而是穿了一双平底的运动鞋。录制现场，男友于小彤端茶送水，虚寒温暖，各种取悦。爆料还称，","url":"http://fun.youth.cn/2015/1205/3054893.shtml","datetime":"2015-12-05 09:34","img_url":"http://p3.pstatp.com/custom/10095/2159619722/0_66_266_252_0.6466/"},{"title":"万万没想到，竟然有这么多明星参演？","abstract":"chickying-橘子编辑 2015-12-04 20:12 影视12月最期待的影片是什么，当然是《万万没想到》啦！《万万没想到：西游篇》今天发布了1号预告，还记得在首款预告里的巨龙是这样。今天的预告里长这样。由5毛特效升级到了良心5块，心里的一块石头落下来了。在石牛镇里住着这","url":"http://a.happyjuzi.com/2015/12/26182.html?d_source=toutiao","datetime":"2015-12-04 20:12","img_url":"http://p2.pstatp.com/list/10076/3935971661"},{"title":"她是《鹿鼎记》大家最喜欢的双儿 如今只能靠露身材抢镜","abstract":"12月2日晚，2015 Mnet Asian Music Awards亚洲音乐盛典，39岁的陈少霞身穿漏背装亮相，晒出与Big Bang的合影和亮相准备的照片。39岁的陈少霞，风韵不减，身材依然很好，漏背的礼服非常抢眼。陈少霞，1993年，18岁的陈少霞与梁朝伟合演电影《哥哥的情","url":"http://toutiao.com/preview_article/?pgc_id=6224332540837102081","datetime":"2015-12-05 09:06","img_url":"http://p1.pstatp.com/list/10064/7194859599"},{"title":"周星驰：我都五十岁了，结婚还来得及吗？","abstract":"他说：\u201c其实我是一个演员，我的名字叫周星驰。\u201d但他对我们而言，却不仅仅一个演员那么简单。从小到大，周星驰带给我们无尽的欢笑。他的电影陪伴很多人度过了难忘美好的时光。最近，有网友突然翻出了柴静在2013年采访星爷的视频，引得大家感慨万千。印象里的他一直都是开心果，是不老的神话。可是","url":"http://toutiao.com/group/6224274177001472258/","datetime":"2015-12-04 20:23","img_url":"http://p1.pstatp.com/list/10078/3674860089"},{"title":"Angelababy挤走郑爽出演电影版微微一笑很倾城 搭档杨洋","abstract":"谁说结了婚的女明星事业运就会走下坡路，这点放在Angelababy身上绝对是打错特错。Angelababy自与黄晓明公开恋情，到举行整个娱乐圈都为之瞩目的ah大婚后，接戏可谓是接到手软。先是在《云中歌》中表现不俗，宣布正式进入电视圈，与郑爽、赵丽颖在内的小花旦们争一席之地，当然，","url":"http://ent.qianzhan.com/detail/151204-60b6a3e7.html","datetime":"2015-12-04 17:04","img_url":"http://p1.pstatp.com/list/10072/1492512175"},{"title":"《芈月传》火的居然是她！孙俪简直哭晕在厕所...","abstract":"导读：由孙俪、刘涛、马苏、方中信、黄轩、高云翔主演的《芈月传》安徽卫视12月8日晚22:00开播啦，然而未播先火的不是孙俪，也不是刘涛，竟然是这位扮演小芈月的刘楚恬...同样是郑晓龙作品，孙俪主演的电视剧，大家看的时候难免会和之前的《甄嬛传》作比较。如果你带着《甄嬛传》的预设去看","url":"http://mp.weixin.qq.com/s?__biz=MjM5OTA0MzQ0MA==&mid=400785443&idx=1&sn=da4144d4ddd070d7a45796b335775cda","datetime":"2015-12-04 18:59","img_url":"http://p1.pstatp.com/list/10075/3435946510"},{"title":"李宇春单飞新歌《混蛋我想你》搞怪引热议 李宇春老公和家庭背景遭扒","abstract":"\u201c万人迷\u201d李宇春将单飞离开天娱，新歌命名为《混蛋我想你》超级搞怪引发网友热议，粉丝纷纷调侃：春春你真逗！我想你！李宇春出道十年，少有绯闻，近期，李宇春老公和家庭背景遭扒，太震惊有木有！春春要回归了！马上出新歌了！日前，李宇春工作室宣布将携手英国独立音乐厂牌PC Music打造李宇","url":"http://ent.zdface.com/mxdt/hotstar/2015-12-04/35225.shtml","datetime":"2015-12-04 09:06","img_url":"http://p1.pstatp.com/list/10078/5434209780"}]}
     */

    private int errNum;
    private String errMsg;
    /**
     * return_count : 20
     * has_more : 1
     * offset : 20
     * data : [{"title":"黄大炜炮轰《康熙》撒谎 发1755字长文怒揭内幕","abstract":"黄大炜在脸书力挺陈小春小S和蔡康永主持的综艺《康熙来了》，在两岸都有极高的收视率和死忠粉丝，岂料2人却在16日无预警宣布\u201c共进退\u201d辞退主持棒，在娱乐圈掀起一阵哗然。原本传艺人陈小春将参加最终集录制，岂料却爆出和制作单位认知不同被退通告，黄大炜更因看不下去，跳出来为好友叫屈，4日在","url":"http://m.gmw.cn/toutiao/2015-12/05/content_110078287.htm","datetime":"2015-12-05 08:58","img_url":"http://p3.pstatp.com/list/10096/2499301616"},{"title":"郭富城再晒用餐恩爱照 第二波\u201c慢一点\u201d体引集体吐槽","abstract":"郭富城破天荒高调晒爱后，他公开恋情时的\u201c慢一点\u201d体也成为网络热潮。第一浪的\u201c开车要慢一点\u201d，引起网友疯狂模仿，而秀恩爱第二波的\u201c慢一点\u201d体，却引发网友集体吐槽，才短短两个半小时，就有超过4万条负评。","url":"http://fun.youth.cn/2015/1205/3056543.shtml","datetime":"2015-12-05 10:54"},{"title":"范冰冰认李晨为最后男友 男方承诺必大婚：当然娶她！","abstract":"小S获准袭胸李晨，连探班的徐妈妈都进场\u201c验货\u201d。范冰冰与小S互相称赞对方的肤质腾讯娱乐讯 据台湾媒体《东森新闻云》12月4日报道，《康熙来了》(视频)日前最后一次进棚录影，请到\u201c范爷\u201d范冰冰和男友李晨跨海相挺担任嘉宾，完成小S想看到范冰冰本人的心愿。","url":"http://ent.cnr.cn/yltj/20151205/t20151205_520696848.shtml","datetime":"2015-12-05 09:16","img_url":"http://p2.pstatp.com/list/10094/3255543821"},{"title":"盘点那些靠激情床戏大火的电视剧","abstract":"","url":"http://m.gmw.cn/toutiao/2015-12/04/content_17971865.htm","datetime":"2015-12-04 18:18","img_url":"http://p3.pstatp.com/list/10074/2687153666"},{"title":"娱乐圈有多少女星为自己老公保留了初夜？","abstract":"自古以来对于女性都是有着极其苛刻的要求和束缚等等，而对于传统的社会来说女人的贞洁尤为重要。随着社会的开放度越来越高，现如今很多人对于\u201c初夜\u201d这个词已经不像我们父辈们那么重视。而对于娱乐圈的女星来说，因为环境的复杂性，为老公保留初夜更是难上加难的事情，下面我们就来盘点一下到底娱乐圈","url":"http://m.cnr.cn/ent/20151204/t20151204_520689329_tt.html","datetime":"2015-12-04 12:44","img_url":"http://p3.pstatp.com/list/10059/6700453056"},{"title":"黄贯中晒凶猛巨型藏獒照 高出朱茵两个头","abstract":"朱茵在巨型藏獒\u201c酋长\u201d身边，俨如小女孩。黄贯中(Paul)日前在微博分享巨无霸\u201c沙展\u201d剥牙的血淋淋经历，他养的藏獒引起不少网民注意。昨天黄贯中又晒宝贝，在微博上载太太朱茵跟另一只藏獒\u201c酋长\u201d的合照。娇小的朱茵站在比她高两个头的\u201c酋长\u201d身边像小女孩。","url":"http://www.zj.xinhuanet.com/yltd/2015-12/05/c_1117365501.htm","datetime":"2015-12-05 11:33","img_url":"http://p3.pstatp.com/list/10095/3331634426"},{"title":"亚洲最帅男人吴尊唯美结婚照曝光 老婆林丽莹美艳动人","abstract":"","url":"http://toutiao.com/preview_article/?pgc_id=6224581809124934145","datetime":"2015-12-05 07:56","img_url":"http://p2.pstatp.com/list/10091/2574489109"},{"title":"时隔8年，《丑女无敌》剧组的不红诅咒还能不能应验？","abstract":"2008年爆红了一部《丑女无敌》，而剧中的主演们却并没有靠这部大剧火起来，今天，阿姨就来扒一下这部\u201c不红诅咒\u201d的电视剧。林无敌\u2014李欣汝今年已经31岁的李欣汝，从08年的《丑女无敌》到现在，她的颜值经历了大幅度的波动，简直就是一个谜。《丑女无敌》里的她是这样的《宝莲灯前传》里的她是","url":"http://toutiao.com/group/6224439253100052737/","datetime":"2015-12-04 23:06","img_url":"http://p2.pstatp.com/custom/10081/4404776115/0_0_400_279_0.43/"},{"title":"娱乐圈里的\u201c神话\u201d竟然培养出这样的儿子","abstract":"他们是众所周知的好搭档，好伴侣。一首\u201c知心爱人\u201d红遍大江南北，其实付笛声还有很多好的作品，比如《众人划桨开大船》《掌声响起来》《你是幸福的， 我是快乐的》等等等，，，但大家可能只记得一首那就是《知心爱人》下面来说说他们的事。1988年与任静相识，1989年2月5日与任静结婚，儿子","url":"http://toutiao.com/preview_article/?pgc_id=6223500350016471553","datetime":"2015-12-04 15:28","img_url":"http://p2.pstatp.com/custom/10011/7959957393/0_136_517_497_0.3327/"},{"title":"她24岁演《倩女幽魂》走红 嫁3亿富翁 化疗致毁容","abstract":"今天是12月2日，大家先记住这个日子早上，香港媒体爆出名媛薛芷伦上街和大妈们吵架，薛芷伦还用手推了大妈一把。这都不是重点，重点是她的脸\u2026\u2026看一边吃蛋挞的大妈们的表情也是把\u201c惊呆\u201d这种心情诠释得很到位更神奇的是，上一次港媒出来报道薛芷伦的新闻正是一年前的今天，14年12月2日\u2026\u2026当","url":"http://www.cnr.cn/ent/list/20151204/t20151204_520690222.shtml","datetime":"2015-12-04 14:08","img_url":"http://p3.pstatp.com/list/10065/3203391737"},{"title":"李宇春修完这个眉毛，人漂亮百倍！","abstract":"我们先来看看眉毛审美大变迁！相比之前的细眉年代，本公举表示活在这个年代真的非常开心啊！！（咳咳，雾面粗眉显脸小！大脸妹你们懂得）The 1920\u2032s\u2014\u2014线型平眉The 1930\u2032s\u2014\u2014拱形细眉The 1940\u2032s\u2014\u2014自然挑眉如今\u2014\u2014请为你生活在如此时髦的年代手动点赞吧！那么说到又","url":"http://toutiao.com/group/6224412069878399234/","datetime":"2015-12-04 21:18","img_url":"http://p3.pstatp.com/list/10024/6199116317"},{"title":"日女星曝游香港被性骚扰：按摩师拉开纸内裤","abstract":"菊地亚美偶像团体\u201c美少女甜甜圈\u201d成员菊地亚美，现积极活跃于各大综艺节目，菊地亚美上综艺节目一向大胆敢言，时常语出惊人。日前菊地亚美出演综艺节目时，针对之前曾经前往香港一事，又爆出惊人话语。菊地亚美说到\u201c之前和友人一同前往香港的按摩店，原本想说体验一下当地有名的按摩，因为是规定，所","url":"http://www.quanminxingtan.com/news/566230d2ac9bdf48fa01018b/share","datetime":"2015-12-05 08:41"},{"title":"郭富城公布恋情深圳交警不服？真相原来是这样的！","abstract":"前天晚上，微博里除了工作就是工作的郭富城居然晒了张牵手照片，并写到\u201c这样开车要慢一点\u201d，哎呦我去，这不是明摆着昭告天下\u201c我也翻了网红的牌了吗\u201d！！来源丨微博、网络文丨请叫我董事长小伙伴们迅速去围观了天王嫂，撸完她皂片的宅男们都自动流出了鼻血，天王嫂就俩字：美！俩字：美得一比！但是","url":"http://toutiao.com/group/6224438705295376642/","datetime":"2015-12-04 23:04","img_url":"http://p3.pstatp.com/list/10079/5508923205"},{"title":"网曝海陆怀孕 于小彤或退出真人秀陪女友待产","abstract":"今日，有微博爆料：\u201c紫薇\u201d海陆已怀孕，\u201c贾宝玉\u201d于小彤喜当爹。这对不被外界看好的姐弟恋似乎将修成正果。爆料中称，海陆在录制真人秀《咱们穿越吧》时，小腹凸起明显，脚上一反常态没有穿女明星的恨天高，而是穿了一双平底的运动鞋。录制现场，男友于小彤端茶送水，虚寒温暖，各种取悦。爆料还称，","url":"http://fun.youth.cn/2015/1205/3054893.shtml","datetime":"2015-12-05 09:34","img_url":"http://p3.pstatp.com/custom/10095/2159619722/0_66_266_252_0.6466/"},{"title":"万万没想到，竟然有这么多明星参演？","abstract":"chickying-橘子编辑 2015-12-04 20:12 影视12月最期待的影片是什么，当然是《万万没想到》啦！《万万没想到：西游篇》今天发布了1号预告，还记得在首款预告里的巨龙是这样。今天的预告里长这样。由5毛特效升级到了良心5块，心里的一块石头落下来了。在石牛镇里住着这","url":"http://a.happyjuzi.com/2015/12/26182.html?d_source=toutiao","datetime":"2015-12-04 20:12","img_url":"http://p2.pstatp.com/list/10076/3935971661"},{"title":"她是《鹿鼎记》大家最喜欢的双儿 如今只能靠露身材抢镜","abstract":"12月2日晚，2015 Mnet Asian Music Awards亚洲音乐盛典，39岁的陈少霞身穿漏背装亮相，晒出与Big Bang的合影和亮相准备的照片。39岁的陈少霞，风韵不减，身材依然很好，漏背的礼服非常抢眼。陈少霞，1993年，18岁的陈少霞与梁朝伟合演电影《哥哥的情","url":"http://toutiao.com/preview_article/?pgc_id=6224332540837102081","datetime":"2015-12-05 09:06","img_url":"http://p1.pstatp.com/list/10064/7194859599"},{"title":"周星驰：我都五十岁了，结婚还来得及吗？","abstract":"他说：\u201c其实我是一个演员，我的名字叫周星驰。\u201d但他对我们而言，却不仅仅一个演员那么简单。从小到大，周星驰带给我们无尽的欢笑。他的电影陪伴很多人度过了难忘美好的时光。最近，有网友突然翻出了柴静在2013年采访星爷的视频，引得大家感慨万千。印象里的他一直都是开心果，是不老的神话。可是","url":"http://toutiao.com/group/6224274177001472258/","datetime":"2015-12-04 20:23","img_url":"http://p1.pstatp.com/list/10078/3674860089"},{"title":"Angelababy挤走郑爽出演电影版微微一笑很倾城 搭档杨洋","abstract":"谁说结了婚的女明星事业运就会走下坡路，这点放在Angelababy身上绝对是打错特错。Angelababy自与黄晓明公开恋情，到举行整个娱乐圈都为之瞩目的ah大婚后，接戏可谓是接到手软。先是在《云中歌》中表现不俗，宣布正式进入电视圈，与郑爽、赵丽颖在内的小花旦们争一席之地，当然，","url":"http://ent.qianzhan.com/detail/151204-60b6a3e7.html","datetime":"2015-12-04 17:04","img_url":"http://p1.pstatp.com/list/10072/1492512175"},{"title":"《芈月传》火的居然是她！孙俪简直哭晕在厕所...","abstract":"导读：由孙俪、刘涛、马苏、方中信、黄轩、高云翔主演的《芈月传》安徽卫视12月8日晚22:00开播啦，然而未播先火的不是孙俪，也不是刘涛，竟然是这位扮演小芈月的刘楚恬...同样是郑晓龙作品，孙俪主演的电视剧，大家看的时候难免会和之前的《甄嬛传》作比较。如果你带着《甄嬛传》的预设去看","url":"http://mp.weixin.qq.com/s?__biz=MjM5OTA0MzQ0MA==&mid=400785443&idx=1&sn=da4144d4ddd070d7a45796b335775cda","datetime":"2015-12-04 18:59","img_url":"http://p1.pstatp.com/list/10075/3435946510"},{"title":"李宇春单飞新歌《混蛋我想你》搞怪引热议 李宇春老公和家庭背景遭扒","abstract":"\u201c万人迷\u201d李宇春将单飞离开天娱，新歌命名为《混蛋我想你》超级搞怪引发网友热议，粉丝纷纷调侃：春春你真逗！我想你！李宇春出道十年，少有绯闻，近期，李宇春老公和家庭背景遭扒，太震惊有木有！春春要回归了！马上出新歌了！日前，李宇春工作室宣布将携手英国独立音乐厂牌PC Music打造李宇","url":"http://ent.zdface.com/mxdt/hotstar/2015-12-04/35225.shtml","datetime":"2015-12-04 09:06","img_url":"http://p1.pstatp.com/list/10078/5434209780"}]
     */

    private RetDataBean retData;

    public int getErrNum() {
        return errNum;
    }

    public void setErrNum(int errNum) {
        this.errNum = errNum;
    }

    public String getErrMsg() {
        return errMsg;
    }

    public void setErrMsg(String errMsg) {
        this.errMsg = errMsg;
    }

    public RetDataBean getRetData() {
        return retData;
    }

    public void setRetData(RetDataBean retData) {
        this.retData = retData;
    }

    public static class RetDataBean {
        private int return_count;
        private int has_more;
        private int offset;
        /**
         * title : 黄大炜炮轰《康熙》撒谎 发1755字长文怒揭内幕
         * abstract : 黄大炜在脸书力挺陈小春小S和蔡康永主持的综艺《康熙来了》，在两岸都有极高的收视率和死忠粉丝，岂料2人却在16日无预警宣布“共进退”辞退主持棒，在娱乐圈掀起一阵哗然。原本传艺人陈小春将参加最终集录制，岂料却爆出和制作单位认知不同被退通告，黄大炜更因看不下去，跳出来为好友叫屈，4日在
         * url : http://m.gmw.cn/toutiao/2015-12/05/content_110078287.htm
         * datetime : 2015-12-05 08:58
         * img_url : http://p3.pstatp.com/list/10096/2499301616
         */

        private List<NewsBean> data;

        public int getReturn_count() {
            return return_count;
        }

        public void setReturn_count(int return_count) {
            this.return_count = return_count;
        }

        public int getHas_more() {
            return has_more;
        }

        public void setHas_more(int has_more) {
            this.has_more = has_more;
        }

        public int getOffset() {
            return offset;
        }

        public void setOffset(int offset) {
            this.offset = offset;
        }

        public List<NewsBean> getData() {
            return data;
        }

        public void setData(List<NewsBean> data) {
            this.data = data;
        }


    }
}
